app/serializers/fitness_class_serializer.rb

SELECT "fitness_class_categories".* FROM "fitness_class_categories" WHERE "fitness_class_categories"."fitness_class_id" = $1  [["fitness_class_id", 5]]
---
	def fitness_class_categories
		self.object.fitness_class_categories.map do |cat| {

SELECT "fitness_class_details".* FROM "fitness_class_details" WHERE "fitness_class_details"."fitness_class_id" = $1  [["fitness_class_id", 5]]
---
	def fitness_class_details
		self.object.fitness_class_details.map do |detail| {