app/controllers/api/v1/admins_controller.rb

	def create

		@admin = Admin.create(admin_params)
---
INSERT INTO "admins" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"