app/controllers/api/v1/auth_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "lehotzky.erica@gmail.com"], ["LIMIT", 1]]
---
	def create
		@admin = Admin.find_by(email: admin_login_params[:email])