app/controllers/api/v1/fitness_class_details_controller.rb

SELECT "fitness_class_details".* FROM "fitness_class_details"
---
	def index
		@fitness_class_details = FitnessClassDetail.all