app/controllers/api/v1/fitness_classes_controller.rb

	def index
		@fitness_classes = FitnessClass.all
---
SELECT "fitness_classes".* FROM "fitness_classes"

	def create
		@fitness_class = FitnessClass.create(fitness_class_params)
		cd = ClassDetail.create(time: params[:time], instructor: "tbd")
		fcd = FitnessClassDetail.create(fitness_class_id: @fitness_class.id, class_detail_id: cd.id)
---
INSERT INTO "fitness_classes" ("name", "description", "class_length", "price", "studio_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "t"], ["description", "t"], ["class_length", 5], ["price", 3], ["studio_id", 6], ["created_at", "2018-10-23 16:49:41.843787"], ["updated_at", "2018-10-23 16:49:41.843787"]]
INSERT INTO "class_details" ("instructor", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["instructor", "tbd"], ["time", "2018-01-01 01:00:00"], ["created_at", "2018-10-23 17:41:43.901222"], ["updated_at", "2018-10-23 17:41:43.901222"]]
INSERT INTO "fitness_class_details" ("fitness_class_id", "class_detail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["fitness_class_id", 32], ["class_detail_id", 15], ["created_at", "2018-10-23 17:41:43.936671"], ["updated_at", "2018-10-23 17:41:43.936671"]]