app/controllers/api/v1/studios_controller.rb

SELECT "studios".* FROM "studios"
---
	def index
		@studios = Studio.all