app/controllers/application_controller.rb

	def current_admin
		if decoded_token
			admin_id = decoded_token[0]["admin_id"]
			@admin = Admin.find_by(id: admin_id)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" IS NULL LIMIT $1  [["LIMIT", 1]]